Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ4010CA91144.atdf
        <module name="BSDAP" id="04702" name2="jtag_bs_dap_sib_v1" version="1a0">
          <instance name="BSDAP">
            <signals>
              <signal group="TCK_SWCLK" function="G" pad="PC20" ioset="1"/>
              <signal group="TDI" function="G" pad="PC17" ioset="1"/>
              <signal group="TDO" function="G" pad="PC19" ioset="1"/>
              <signal group="TMS_SWDIO" function="G" pad="PC18" ioset="1"/>
            </signals>
            <parameters>
              <param name="MCLK_ID_DAP" value="80" caption="Index for BSDAP DAP clock"/>
            </parameters>
          </instance>
        </module>
        <module name="CAN" id="03723" name2="can_fd_u2003_v4" version="4a0">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x45060000"/>
            <signals>
              <signal group="RX" function="H" pad="PC04" ioset="1"/>
              <signal group="RX" function="H" pad="PC19" ioset="2"/>
              <signal group="TX" function="H" pad="PC05" ioset="1"/>
              <signal group="TX" function="H" pad="PC20" ioset="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="83" caption="DMA CAN Debug Req"/>
              <param name="ECC_BERR_IMPLEMENTED" value="0" caption="ECC error"/>
              <param name="EXT_TSTAMP_IMPLEMENTED" value="0" caption="External time stamp"/>
              <param name="GCLK_ID" value="46" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="INSTANCE_ID" value="48" caption="Instance index for CAN0"/>
              <param name="MCLK_ID_AHB" value="56" caption="Index for CAN0 AHB clock"/>
              <param name="PAC_ID" value="48" caption="Index for CAN0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="CAN1">
            <register-group name="CAN1" name-in-module="CAN" address-space="base" offset="0x46060000"/>
            <signals>
              <signal group="RX" function="H" pad="PC06" ioset="1"/>
              <signal group="RX" function="H" pad="PD08" ioset="2"/>
              <signal group="TX" function="H" pad="PC07" ioset="1"/>
              <signal group="TX" function="H" pad="PD09" ioset="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="84" caption="DMA CAN Debug Req"/>
              <param name="ECC_BERR_IMPLEMENTED" value="0" caption="ECC error"/>
              <param name="EXT_TSTAMP_IMPLEMENTED" value="0" caption="External time stamp"/>
              <param name="GCLK_ID" value="47" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="INSTANCE_ID" value="49" caption="Instance index for CAN1"/>
              <param name="MCLK_ID_AHB" value="57" caption="Index for CAN1 AHB clock"/>
              <param name="PAC_ID" value="49" caption="Index for CAN1 registers write protection"/>
            </parameters>
          </instance>
          <instance name="CAN2">
            <register-group name="CAN2" name-in-module="CAN" address-space="base" offset="0x46062000"/>
            <signals>
              <signal group="RX" function="H" pad="PC25"/>
              <signal group="TX" function="H" pad="PC26"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="85" caption="DMA CAN Debug Req"/>
              <param name="ECC_BERR_IMPLEMENTED" value="0" caption="ECC error"/>
              <param name="EXT_TSTAMP_IMPLEMENTED" value="0" caption="External time stamp"/>
              <param name="GCLK_ID" value="48" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="INSTANCE_ID" value="50" caption="Instance index for CAN2"/>
              <param name="MCLK_ID_AHB" value="58" caption="Index for CAN2 AHB clock"/>
              <param name="PAC_ID" value="50" caption="Index for CAN2 registers write protection"/>
            </parameters>
          </instance>
          <instance name="CAN3">
            <register-group name="CAN3" name-in-module="CAN" address-space="base" offset="0x45860000"/>
            <signals>
              <signal group="RX" function="H" pad="PC29"/>
              <signal group="TX" function="H" pad="PD13"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="86" caption="DMA CAN Debug Req"/>
              <param name="ECC_BERR_IMPLEMENTED" value="0" caption="ECC error"/>
              <param name="EXT_TSTAMP_IMPLEMENTED" value="0" caption="External time stamp"/>
              <param name="GCLK_ID" value="49" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="INSTANCE_ID" value="51" caption="Instance index for CAN3"/>
              <param name="MCLK_ID_AHB" value="59" caption="Index for CAN3 AHB clock"/>
              <param name="PAC_ID" value="51" caption="Index for CAN3 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000ED00"/>
          </instance>
        </module>
        <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1a0">
          <instance name="DMA">
            <register-group name="DMA" name-in-module="DMA" address-space="base" offset="0x44850000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="19" caption="Instance index for DMA"/>
              <param name="MCLK_ID_APB" value="25" caption="Index for DMA APB clock"/>
              <param name="MCLK_ID_AXI" value="24" caption="Index for DMA AXI clock"/>
              <param name="PAC_ID" value="19" caption="Index for DMA registers write protection"/>
            </parameters>
          </instance>
        </module>
